## K-최근접 이웃 알고리즘

새로운 데이터가 들어오면 **이웃 데이터를 이용해서 분류하고 정답을 예측**하는 알고리즘.

### 특징

1. 데이터와 정답을 제공한 후 새로운 데이터를 넣는 방식이기 때문에 **지도학습**이다.
2. 가장 가까운 데이터를 바탕으로 정답을 예상한다.
3. 몇 차원이어도 거리를 구할 수 있으니 이웃과 나의 거리를 비교한다.
    1. 거리 계산은 유클리드 거리 계산법을 사용하면 뭐든지 계산 할 수 있다.
4. n_neighbors 의 값은 K-최근접 이웃 알고리즘을 수행하는 모델이 정답을 맞춘 점수를 도출해낼 때 다수결을 낼 때 이 값을 사용한다.
예) n_neighbors = 10이면 가장 가까운 데이터 10개를 갖고 다수결을 낸다.

## kn 객체

클래서(설계도)로 찍어낸 객체. 
**KNeighborsClassifier(K-최근접 이웃 알고리즘)이라는 틀로 찍어낸 하나의 모델.**
코드에서 kn이라는 이름으로 모델을 정해서 이름이 kn인거라 **객체의 이름은 마음대로 정할 수 있다.**

이하 메서드는 kn에 딸려있는 kn 전용 메서드이다.

### fit 메서드

kn 모델에게 **“학습해라”라고 명령하는 메서드**이다.
kn(KNeighborsClassifier)객체에 딸려 있어야 사용할 수 있는 kn 전용 함수.
함수이긴 하지만 **항상 객체에 딸려있어야 하기 때문에 메서드**라고 부른다.

### predict 메서드

kn 모델에게 **“문제를 풀어”라고 명령하는 메서드**이다.
학습하지 않은 문제를 주고 이미 훈련한 데이터를 기반으로 문제를 푼다.
자신이 예측한 답이 무엇인지 N개(특성의 개수)짜리 배열로 출력한다.

### score 메서드

kn 모델에게 **“모든 문제를 풀고 정답을 비율로 나타내”라고 명령하는 메서드**이다.